[
    {
        "source": "G2",
        "company": "Slack",
        "review_title": "\"Smooth UX with Seamless Integrations\"",
        "review_text": "What do you like best about Slack?\nI use Slack for communicating with my colleagues through chats and calls. It's really easy to navigate, and I find the calls seamless. The user interface and user experience are great; it's easy on the eyes. I appreciate that files are located under a single tab, and the ability to search text under specific channels is a big plus. Slack also supports a good number of external plugins, like Outlook, which pings and reminds me of any upcoming meetings. The user experience feels very smooth, and it's easy to navigate, search, and access messages through the applications.\nReview collected by and hosted on G2.com.\nWhat do you dislike about Slack?\nI sometimes don’t get notifications even though not on mute. They also sometimes get delayed, although very rarely. Occasional connection issues.\nReview collected by and hosted on G2.com.",
        "date": "2025-12-23",
        "rating": 4.5,
        "reviewer_info": "Ankit T."
    },
    {
        "source": "G2",
        "company": "Slack",
        "review_title": "\"Essential for Company-Wide Communication and Collaboration\"",
        "review_text": "What do you like best about Slack?\nI love using Slack because it integrates such an inviting platform for companies to communicate with their employees! I work for a large company and there are people working in a lot of different states. Slack gives the company I work for so much ability to be able to work and interact with everyone at once. Its incredible!\nReview collected by and hosted on G2.com.\nWhat do you dislike about Slack?\nI don't like how you cant turn on individual notifications for specific people on slack channels. We have a company wide channel with 2,000 people and it can be very annoying receiving every notification and not just the important one from the bosses. Would love that feature to be added in so I can highlight and be notified on things that matter the most!\nReview collected by and hosted on G2.com.",
        "date": "2025-12-20",
        "rating": 5.0,
        "reviewer_info": "Timothy S."
    },
    {
        "source": "G2",
        "company": "Slack",
        "review_title": "\"Easy, Organized, and Effective Team Messaging\"",
        "review_text": "What do you like best about Slack?\nI like how Slack keeps all team communication organized in one place. Channels make it easy to find discussions, and quick huddles reduce unnecessary meetings. Saved messages help me keep track of important info without effort. I mostly use channels and group chats to keep conversations organized and transparent. Quick huddles are great for fast discussions. Creating channels, adding team members, and getting started did not take much time, and most of the team picked it up quickly without much training.\nReview collected by and hosted on G2.com.\nWhat do you dislike about Slack?\nSometimes notifications can feel overwhelming, especially across multiple channels. Searching works well most of the time, but finding older messages can still be a bit tricky. The mobile app can feel heavy when integrations are enabled.\nReview collected by and hosted on G2.com.",
        "date": "2025-12-19",
        "rating": 4.5,
        "reviewer_info": "Anand C."
    },
    {
        "source": "G2",
        "company": "Slack",
        "review_title": "\"Essential for Seamless Remote Team Communication\"",
        "review_text": "What do you like best about Slack?\nSlack helps our fully-remote team communicate across daily 3 time zones without missing a beat. We can have a dozen different conversations on different topics and (usually) keep up with them all across the Slack platform. There are options for direct messages and for team conversations. It integrates with Google Drive to show previews right in the channel. It helps us link to our larger organization as well. It's all searchable, so if we can't remember where something is, it's not too hard to find. We use it constantly and it's the backbone of our project. I've never had a problem requiring help from Customer Support; it's easy to use.\nReview collected by and hosted on G2.com.\nWhat do you dislike about Slack?\nWe rely on it so much that sometimes it gets a little unwieldy. A team member who happens to miss a conversation logs on later only to find 145 replies and nobody wants to read that thread.\nReview collected by and hosted on G2.com.",
        "date": "2025-12-19",
        "rating": 5.0,
        "reviewer_info": "Sarah C."
    },
    {
        "source": "G2",
        "company": "Slack",
        "review_title": "\"Makes Team Communication Simple and Fast\"",
        "review_text": "What do you like best about Slack?\nSlack makes team communication fast, organized, and easy to follow. Channels help keep conversations focused by topic or project, reducing email clutter and making information easy to find later. I especially like the integrations with tools like Notion, Google Drive, and calendars, which keep updates and work context in one place.\nReview collected by and hosted on G2.com.\nWhat do you dislike about Slack?\nIt becomes distracting if notifications aren’t carefully managed, especially in larger teams with many active channels. Important messages can sometimes get lost in busy conversations. The free plan has limitations on message history and features, and over time the number of channels can feel cluttered without strong usage guidelines.\nReview collected by and hosted on G2.com.",
        "date": "2025-12-16",
        "rating": 5.0,
        "reviewer_info": "M. Umair M."
    },
    {
        "source": "G2",
        "company": "Slack",
        "review_title": "\"Great to use!\"",
        "review_text": "What do you like best about Slack?\nThis platform brings all communication and collaboration together in a single location, which I find very convenient. I appreciate how easy it is to implement and how smoothly it integrates with tools such as Google Drive, Zoom, and Trello, helping to maintain an efficient and uninterrupted workflow. The customer support is also very responsive, quickly addressing any issues that arise. Overall, it is user-friendly and well-suited for frequent daily use.\nReview collected by and hosted on G2.com.\nWhat do you dislike about Slack?\nAt times, it can feel overwhelming when there are too many channels or notifications. I would appreciate more streamlined options for managing notifications, as well as having access to additional features without needing to upgrade.\nReview collected by and hosted on G2.com.",
        "date": "2025-12-16",
        "rating": 5.0,
        "reviewer_info": "Gabriela R."
    },
    {
        "source": "G2",
        "company": "Slack",
        "review_title": "\"Drives Fast Collaboration and Seamless Integrations\"",
        "review_text": "What do you like best about Slack?\nI like Slack because it drives real time cross team coordination and faster decisions, keeping work visible in channels where we already collaborate. I use it to run discovery threads, share config files, and get quick feedback from partners in DS and IDM without meetings. Its integrations bring signals to me, like Qualtrics updates in channel and orchestration alerts tied to Sidekick workflows, so I do not have to chase status across tools. It is also a first class interface for tools like MOOSE, letting me share sessions and collect feedback directly in chat to reduce context switching. Onboarding and identity are simple, so getting set up or sharing my member ID for access is quick when teammates need to add me to apps or channels.\nReview collected by and hosted on G2.com.\nWhat do you dislike about Slack?\nHere is what I dislike about Slack in my day to day work. It makes it easy for work to fragment across DMs and channels, so decisions and context get buried and search often does not surface the one message I need. Channel sprawl and notification noise make it hard to keep up without muting something important. Threads are inconsistent and easy to break, which scatters conversations and leaves me reconstructing context later. Files shared in chat drift into multiple versions and are hard to rediscover, so I still need a separate source of truth in Confluence or Jira. Integrations are valuable, but they can create alert fatigue and make it harder to distinguish signal from noise. Access and app management can also be clunky at times, like when I need to pass around member IDs or wait on approvals to add bots. In short, Slack is great for speed, but it is not great for permanence, structure, or findability.\nReview collected by and hosted on G2.com.",
        "date": "2025-12-16",
        "rating": 4.5,
        "reviewer_info": "RUSSELL K."
    },
    {
        "source": "G2",
        "company": "Slack",
        "review_title": "\"Excellent communication with easy installation and integration\"",
        "review_text": "What do you like best about Slack?\nI like Slack because it particularly enables the team for conversation and coordination. Its biggest advantage is that it is not difficult. I get the opportunity to explain my point within its limits, and I can easily share links or pieces of code with the team. Its use is especially easy for me because it is available on diverse platforms and integrating with different programs is very simple. I integrate it with Mgin and it automatically gives notifications in case of a traffic spike. The notification system inside Slack is very helpful and it works easily with Jira, Middle Bed DotIO as well. Its setup is very simple and I like its multi-platform availability. Managing different workspaces is easy here, and I can manage them well according to my needs.\nReview collected by and hosted on G2.com.\nWhat do you dislike about Slack?\nI face the biggest problem with word limitation in Slack. I have to explain my work or issues within a small and limited number of words.\nReview collected by and hosted on G2.com.",
        "date": "2025-12-13",
        "rating": 4.0,
        "reviewer_info": "Ankan S."
    },
    {
        "source": "G2",
        "company": "Slack",
        "review_title": "\"Effortless Team Communication and File Sharing\"",
        "review_text": "What do you like best about Slack?\nWhat I appreciate most about Slack is how simple it makes communicating with colleagues, whether it's about work matters or personal topics. Another useful feature is the ability to review the history of previous conversations. Additionally, it's convenient that we can send large files through the platform.\nReview collected by and hosted on G2.com.\nWhat do you dislike about Slack?\nOverall, Slack is a welcoming platform and a useful tool.\nReview collected by and hosted on G2.com.",
        "date": "2025-12-11",
        "rating": 5.0,
        "reviewer_info": "Ruby Ann  G."
    },
    {
        "source": "G2",
        "company": "Slack",
        "review_title": "\"Effortless Team Communication and Seamless Collaboration\"",
        "review_text": "What do you like best about Slack?\nI like slack because it make communication with my team very easy and efficient. i can create public or private channels and different teams based on our needs. i also use slack huddles a lot, especially when i'm working from home, as it helps me communicate quickly and stay connected with my team.\nReview collected by and hosted on G2.com.\nWhat do you dislike about Slack?\nthere isn't much that i dislike about slack. However, sometimes when i start a huddle, the app becomes a bit laggy. Occasionally, notifications are also delayed and i receive them late. Other than these minor issues, everything work well for me.\nReview collected by and hosted on G2.com.",
        "date": "2025-12-15",
        "rating": 5.0,
        "reviewer_info": "Sanket P."
    }
]